app/views/visits/_form.slim

SELECT `clients`.* FROM `clients`
---
      .field
        = f.collection_select :client_id, Client.all,:id,:name,:prompt => "Select a Client"

SELECT `masters`.* FROM `masters`
SELECT `offers`.* FROM `offers`
---
        .field
          = f.collection_select :master_id, Master.all, :id, :name, prompt: "Select a Master", id: 'master_select'
      .field
        = f.collection_select :offers_list, Offer.all,:id,:name,:prompt => "Select an offer"
      .actions