app/views/masters/_form.html.erb

    <label for="master_category_id">Category:</label><br />
    <%= f.collection_select :category_id, Category.all, :id, :name, prompt: "Select a Category" %>
---
SELECT `categories`.* FROM `categories`