app/views/masters/destroy_all_masters.slim

        th= t('common.actions')
      - Master.all.each do |master|
---
SELECT `masters`.* FROM `masters`