app/views/users/_edit_multiple.html.erb

          <tbody>
            <% User.where(admin: false).all.each do |user| %>
---
SELECT `users`.* FROM `users` WHERE `users`.`admin` = FALSE