app/views/users/_manager_edit_multiple.slim

SELECT `users`.* FROM `users` WHERE `users`.`admin` = FALSE
---
    th= "Action"
  - User.where(admin: false).each do |user|