app/views/users/index.slim


  - User.where(admin: false).each do |user|
---
SELECT `users`.* FROM `users` WHERE `users`.`admin` = FALSE