app/views/clients/_clients_table.html.erb

      th= link_to "Суммарные траты", sort: "average_spending"
    - Client.all.each do |client|
---
SELECT `clients`.* FROM `clients`