app/views/clients/show.slim

        th= "Итоговая стоимость"
      - Visit.where(client_id: @client.id).all.each do |visit|
---
SELECT `visits`.* FROM `visits` WHERE `visits`.`client_id` = 1

          td= visit.master.name
          td= Offer.find(visit.offers_list).name
---
SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 8 LIMIT 1