app/views/pages/_category_widget.slim

SELECT `categories`.* FROM `categories`
---
  .card-body
    - Category.all.each do |category|
      .p