app/views/pages/home.html.erb


    <% User.where(admin: false).each do |user|%>
---
SELECT `users`.* FROM `users` WHERE `users`.`admin` = FALSE