app/views/pages/home.slim

SELECT `clients`.* FROM `clients`
---
      - if current_user and current_user.admin?
      - Client.all.each do |client|