app/helpers/visits_helper.rb

  def masters_for_select
    options_from_collection_for_select(Master.all, 'id', 'name')
---
SELECT `masters`.`name`, `masters`.`id` FROM `masters`