app/views/offers/_form.html.erb

          <label for="master_category_id">Category:</label><br />
          <%= f.collection_select :category_id, Category.all, :id, :name, :prompt => "Select a Category",id: "category_id", :onchange => "myFunction()"%>
---
SELECT `categories`.* FROM `categories`

              <label for="master_category_id">Master:</label><br />
              <%= f.collection_select :master_id, Master.all, :id, :name, :prompt => "Select a Master" %>
---
SELECT `masters`.* FROM `masters`