app/views/offers/index.slim

SELECT `offers`.* FROM `offers`
---
        th= "Action"
      - Offer.all.each do |offer|