app/controllers/categories_controller.rb

  def update
  @category = Category.find params[:id]
  @category.update_attributes(category_params)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 8 LIMIT 1
UPDATE `categories` SET `name` = 'Ванна' WHERE `categories`.`id` = 6

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO `categories` (`name`) VALUES ('Массаж')

  def set_creatures
    @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 8 LIMIT 1