app/controllers/clients_controller.rb

INSERT INTO `clients` (`name`, `patronymic`, `surname`, `date_of_birth`, `created_at`, `updated_at`, `city`, `street`, `region`, `country`, `building`, `flat`) VALUES ('Анастасия', 'Дмитириевна', 'Шиманская', '2000-08-08 21:00:00', '2019-04-10 20:54:46', '2019-04-10 20:54:46', 'Минск', 'ул. М. Горецкого', 'Минская область', 'Беларусь', '1', 168)
---
  def create
    @client = Client.new(client_params)
    if @client.save

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 0 LIMIT 1
---
  def edit
      @client = Client.find(params[:id])

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
  def update
    @client = Client.find(params[:id])

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
  def set_client
  @client = Client.find(params[:id])