app/controllers/masters_controller.rb

  def destroy
    @master=Master.where(id: params[:@master_ids])
    @master.destroy_all
---
SELECT  `masters`.* FROM `masters` WHERE `masters`.`id` = 5 LIMIT 1
DELETE FROM `masters` WHERE `masters`.`id` = 5

  def create
    @master = Master.new(master_params)
    if @master.save
---
INSERT INTO `masters` (`name`, `category_id`, `surname`, `patronymmic`) VALUES ('Cоня', 9, 'Синь', 'Кирилловна')

  def destroy_all_masters
    @master=Master.where(id: params[:master_ids])
    @master.destroy_all
---
SELECT `masters`.* FROM `masters` WHERE `masters`.`id` IS NULL
DELETE FROM `masters` WHERE `masters`.`id` = 10

  def update
    @master = Master.find(params[:id])
    @master.update_attributes(master_params)
---
SELECT  `masters`.* FROM `masters` WHERE `masters`.`id` = 1 LIMIT 1
UPDATE `masters` SET `name` = 'Катенька' WHERE `masters`.`id` = 10

  def index
    @masters = Master.all
---
SELECT `masters`.* FROM `masters`

  def set_master
  @master = Master.find(params[:id])
---
SELECT  `masters`.* FROM `masters` WHERE `masters`.`id` = 5 LIMIT 1