app/controllers/offers_controller.rb

DELETE FROM `offers` WHERE `offers`.`id` = 1
---
  def destroy
    @offer.destroy