app/controllers/offers_controller.rb

  def destroy_all_offers
    @offer= Offer.where(id: params[:offer_ids])
    @offer.destroy_all
---
SELECT `offers`.* FROM `offers` WHERE `offers`.`id` IN (16, 17)
DELETE FROM `offers` WHERE `offers`.`id` = 15

  def update
    @offer = Offer.find(params[:id])
    @offer.update_attributes(offer_params)
---
SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 16 LIMIT 1
UPDATE `offers` SET `duration` = '22:30:00' WHERE `offers`.`id` = 16

  def create
    @offer = Offer.new(offer_params)
    if @offer.save
---
INSERT INTO `offers` (`price`, `name`, `description`, `master_id`, `category_id`, `duration`) VALUES (15.5, 'Пенная ванночка', 'Прекрасно дополняет все процедуры', 35, 6, '22:12:00')

  def index
    @offers = Offer.all
---
SELECT `offers`.* FROM `offers`

  def set_offer
  @offer = Offer.find(params[:id])
---
SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 16 LIMIT 1