app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `name`) VALUES ('1@gmail.com', '$2a$11$hSvsPtVPSEZhURwOdQH7sesgp8hZ2saFlMS5WQKK8N9SMkZ3bE1PO', '2019-04-08 20:38:40', '2019-04-08 20:38:40', 'Misha')
---
  def create_by_owner
       @user = User.new(manager_params)
       if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 17 LIMIT 1
UPDATE `users` SET `email` = '2@gmail.com', `updated_at` = '2019-04-08 21:06:58' WHERE `users`.`id` = 18
---
  def update
    @user = User.find(params[:id])
    @user.update_attributes(manager_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 15
---
  def destroy_all
    @user=User.where(id: params[:user_ids])
    @user.destroy_all