app/controllers/visits_controller.rb

  def create
    @visit = Visit.new(visit_params)
    client_id = @visit.client_id
    @client = Client.where(id: client_id)
    if @visit.save
---
SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
INSERT INTO `visits` (`client_id`, `offers_list`, `date_of_visit`, `created_at`, `updated_at`, `master_id`) VALUES (1, '8', '2019-04-09', '2019-04-10 21:19:13', '2019-04-10 21:19:13', 10)