app/models/client.rb

SELECT COUNT(*) FROM `visits` WHERE `visits`.`client_id` = 1
UPDATE `clients` SET `average_spending` = 46.5, `updated_at` = '2019-04-10 22:31:10' WHERE `clients`.`id` = 1
---
  def total_visits
    average_visits = self.visits.count
    self.update(average_visits: average_visits)

SELECT `clients`.* FROM `clients`
SELECT `visits`.* FROM `visits` WHERE `visits`.`client_id` = 2
---
  def total_spending
    average=0.0
    self.visits.all.each do |visit|