app/models/visit.rb

SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 8 LIMIT 1
UPDATE `visits` SET `price` = 15.5, `updated_at` = '2019-04-10 22:04:03' WHERE `visits`.`id` = 5
---
  def total_price
      @offer =  Offer.find(self.offers_list)
      price = @offer.price
      self.update(:price => price)