app/views/categories/show.slim

SELECT `masters`.* FROM `masters` WHERE `masters`.`category_id` = 1
SELECT `offers`.* FROM `offers` WHERE `offers`.`category_id` = 1
---
  = render 'edit'
  - if !@masters.blank?
    .h4 =t('common.master_of_category')
    = render 'masters_results'
  - if !@offers.blank?
    .h4 =t('common.offers_of_category')